; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v8 ?v11)
             (pred_5 ?v10 ?v12)
             (pred_3 ?v8 ?v12)
             (pred_9 ?v7 ?v8 )
	     (pred_8 ?v8)
             (pred_6 ?v4)
             (pred_4 ?v10)
             (pred_10 ?v12)
             (pred_11 ?v8)
             (pred_7 ?v10)
             (pred_1 ?v8)
             (pred_2 ))



(:action op_1
:parameters (?v6 ?v9 ?v5 ?v1)
:precondition (and (pred_6 ?v6) (pred_6 ?v9) (pred_4 ?v5) (pred_10 ?v1)
          (pred_12 ?v6 ?v9) (pred_5 ?v5 ?v1)
                   (pred_3 ?v9 ?v1) (pred_8 ?v6) 
                   (pred_11 ?v9) (pred_7 ?v5))
:effect (and  (pred_1 ?v9) (not (pred_11 ?v9))))


(:action op_2
:parameters (?v6 ?v13)
:precondition (and (pred_6 ?v6) (pred_6 ?v13)
               (pred_8 ?v6) (pred_12 ?v6 ?v13) (pred_1 ?v13))
:effect (and (pred_8 ?v13) (not (pred_8 ?v6))))

(:action op_3
:parameters (?v6 ?v5)
:precondition (and (pred_6 ?v6) (pred_4 ?v5) 
                  (pred_8 ?v6) (pred_9 ?v5 ?v6) (pred_2 ))
:effect (and (pred_7 ?v5)
   (not (pred_9 ?v5 ?v6)) (not (pred_2 ))))


(:action op_4
:parameters (?v6 ?v3 ?v2)
:precondition (and (pred_6 ?v6) (pred_4 ?v3) (pred_4 ?v2)
                  (pred_8 ?v6) (pred_7 ?v2) (pred_9 ?v3 ?v6))
:effect (and (pred_7 ?v3) (pred_9 ?v2 ?v6)
        (not (pred_7 ?v2)) (not (pred_9 ?v3 ?v6))))

(:action op_5
:parameters (?v6 ?v5)
:precondition (and (pred_6 ?v6) (pred_4 ?v5) 
                  (pred_8 ?v6) (pred_7 ?v5))
:effect (and (pred_2 ) (pred_9 ?v5 ?v6) (not (pred_7 ?v5)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_12 obj_03 obj_05 obj_20 obj_29 obj_27 obj_16 obj_21 obj_22 obj_28 obj_31 obj_09 obj_15 obj_13 obj_19 obj_04 obj_25 obj_30 obj_11 obj_24 obj_02 obj_08 obj_07 obj_14
    obj_17 obj_10 obj_06
    obj_01 obj_26 obj_23
    )

    (:init
       (pred_2)

       (pred_6 obj_18)
       (pred_6 obj_12)
       (pred_6 obj_03)
       (pred_6 obj_05)
       (pred_6 obj_20)
       (pred_6 obj_29)
       (pred_6 obj_27)
       (pred_6 obj_16)
       (pred_6 obj_21)
       (pred_6 obj_22)
       (pred_6 obj_28)
       (pred_6 obj_31)
       (pred_6 obj_09)
       (pred_6 obj_15)
       (pred_6 obj_13)
       (pred_6 obj_19)
       (pred_6 obj_04)
       (pred_6 obj_25)
       (pred_6 obj_30)
       (pred_6 obj_11)
       (pred_6 obj_24)
       (pred_6 obj_02)
       (pred_6 obj_08)
       (pred_6 obj_07)
       (pred_6 obj_14)
       (pred_10 obj_17)
       (pred_10 obj_10)
       (pred_10 obj_06)
       (pred_4 obj_01)
       (pred_4 obj_26)
       (pred_4 obj_23)

       (pred_12 obj_18 obj_29)
       (pred_12 obj_18 obj_12)
       (pred_12 obj_12 obj_27)
       (pred_12 obj_12 obj_03)
       (pred_12 obj_12 obj_18)
       (pred_12 obj_03 obj_16)
       (pred_12 obj_03 obj_05)
       (pred_12 obj_03 obj_12)
       (pred_12 obj_05 obj_21)
       (pred_12 obj_05 obj_20)
       (pred_12 obj_05 obj_03)
       (pred_12 obj_20 obj_22)
       (pred_12 obj_20 obj_05)
       (pred_12 obj_29 obj_28)
       (pred_12 obj_29 obj_27)
       (pred_12 obj_29 obj_18)
       (pred_12 obj_27 obj_31)
       (pred_12 obj_27 obj_16)
       (pred_12 obj_27 obj_12)
       (pred_12 obj_27 obj_29)
       (pred_12 obj_16 obj_09)
       (pred_12 obj_16 obj_21)
       (pred_12 obj_16 obj_03)
       (pred_12 obj_16 obj_27)
       (pred_12 obj_21 obj_15)
       (pred_12 obj_21 obj_22)
       (pred_12 obj_21 obj_05)
       (pred_12 obj_21 obj_16)
       (pred_12 obj_22 obj_13)
       (pred_12 obj_22 obj_20)
       (pred_12 obj_22 obj_21)
       (pred_12 obj_28 obj_19)
       (pred_12 obj_28 obj_31)
       (pred_12 obj_28 obj_29)
       (pred_12 obj_31 obj_04)
       (pred_12 obj_31 obj_09)
       (pred_12 obj_31 obj_27)
       (pred_12 obj_31 obj_28)
       (pred_12 obj_09 obj_25)
       (pred_12 obj_09 obj_15)
       (pred_12 obj_09 obj_16)
       (pred_12 obj_09 obj_31)
       (pred_12 obj_15 obj_30)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_15 obj_21)
       (pred_12 obj_15 obj_09)
       (pred_12 obj_13 obj_11)
       (pred_12 obj_13 obj_22)
       (pred_12 obj_13 obj_15)
       (pred_12 obj_19 obj_24)
       (pred_12 obj_19 obj_04)
       (pred_12 obj_19 obj_28)
       (pred_12 obj_04 obj_02)
       (pred_12 obj_04 obj_25)
       (pred_12 obj_04 obj_31)
       (pred_12 obj_04 obj_19)
       (pred_12 obj_25 obj_08)
       (pred_12 obj_25 obj_30)
       (pred_12 obj_25 obj_09)
       (pred_12 obj_25 obj_04)
       (pred_12 obj_30 obj_07)
       (pred_12 obj_30 obj_11)
       (pred_12 obj_30 obj_15)
       (pred_12 obj_30 obj_25)
       (pred_12 obj_11 obj_14)
       (pred_12 obj_11 obj_13)
       (pred_12 obj_11 obj_30)
       (pred_12 obj_24 obj_02)
       (pred_12 obj_24 obj_19)
       (pred_12 obj_02 obj_08)
       (pred_12 obj_02 obj_04)
       (pred_12 obj_02 obj_24)
       (pred_12 obj_08 obj_07)
       (pred_12 obj_08 obj_25)
       (pred_12 obj_08 obj_02)
       (pred_12 obj_07 obj_14)
       (pred_12 obj_07 obj_30)
       (pred_12 obj_07 obj_08)
       (pred_12 obj_14 obj_11)
       (pred_12 obj_14 obj_07)
       (pred_11 obj_24)
       (pred_11 obj_04)
       (pred_11 obj_30)
       (pred_3  obj_24 obj_17)
       (pred_3  obj_04 obj_10)
       (pred_3  obj_30 obj_06)
       (pred_1 obj_18)
       (pred_1 obj_12)
       (pred_1 obj_03)
       (pred_1 obj_05)
       (pred_1 obj_20)
       (pred_1 obj_29)
       (pred_1 obj_27)
       (pred_1 obj_16)
       (pred_1 obj_21)
       (pred_1 obj_22)
       (pred_1 obj_28)
       (pred_1 obj_31)
       (pred_1 obj_09)
       (pred_1 obj_15)
       (pred_1 obj_13)
       (pred_1 obj_19)
       (pred_1 obj_25)
       (pred_1 obj_11)
       (pred_1 obj_02)
       (pred_1 obj_08)
       (pred_1 obj_07)
       (pred_1 obj_14)

       (pred_5  obj_01 obj_17)
       (pred_5  obj_26 obj_10)
       (pred_5  obj_23 obj_06)
       (pred_9 obj_01 obj_07)
       (pred_9 obj_26 obj_25)
       (pred_9 obj_23 obj_02)
       (pred_8 obj_29)
    )

    (:goal (and
       (pred_9 obj_23 obj_22)
    ))
(:constraints
  (always (not (pred_8 obj_09)))
)
)

; plan
1. (op_2 obj_29 obj_27)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_27)
   goals met: 0 of 1
2. (op_2 obj_27 obj_16)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_16)
   goals met: 0 of 1
3. (op_2 obj_16 obj_21)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_21)
   goals met: 0 of 1
4. (op_2 obj_21 obj_15)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_15)
   goals met: 0 of 1
5. (op_2 obj_15 obj_13)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_13)
   goals met: 0 of 1
6. (op_2 obj_13 obj_11)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_11)
   goals met: 0 of 1
7. (op_2 obj_11 obj_14)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_14)
   goals met: 0 of 1
8. (op_2 obj_14 obj_07)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_07)
   goals met: 0 of 1
9. (op_2 obj_07 obj_08)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_08)
   goals met: 0 of 1
10. (op_2 obj_08 obj_02)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_02)
   goals met: 0 of 1
11. (op_3 obj_02 obj_23)
   deleted: (pred_9 obj_23 obj_02) (pred_2)
   added: (pred_7 obj_23)
   goals met: 0 of 1
12. (op_2 obj_02 obj_08)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_08)
   goals met: 0 of 1
13. (op_2 obj_08 obj_07)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_07)
   goals met: 0 of 1
14. (op_2 obj_07 obj_14)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_14)
   goals met: 0 of 1
15. (op_2 obj_14 obj_11)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_11)
   goals met: 0 of 1
16. (op_2 obj_11 obj_13)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_13)
   goals met: 0 of 1
17. (op_2 obj_13 obj_22)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_22)
   goals met: 0 of 1
18. (op_5 obj_22 obj_23)
   deleted: (pred_7 obj_23)
   added: (pred_2) (pred_9 obj_23 obj_22)
   goals met: 1 of 1
